Tekla Open API Reference for Tekla Structures 2025
ClashCheckOptions.BoltHeadDiameter Property
The bolt head diameter.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double BoltHeadDiameter { get; set; }
Public Property BoltHeadDiameter As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ClashCheckOptions Class
Tekla.Structures Namespace